package com.moali.eqraa.domain.models

data class Tasbeha (
    val id:Int=-1,
    val name:String="",
    val useful:String=""
){
}

val tasbehat= listOf<Tasbeha>(
    Tasbeha(
        id = 1,
        name="سبحان الله وبحمده",
        useful = " قال النبي صلى الله عليه وسلم: \"من قال سبحان الله وبحمده مائة مرة في اليوم، غفرت ذنوبه وإن كانت مثل زبد البحر\" (صحيح البخاري ومسلم)."
    ),
    Tasbeha(
        id = 2,
        name="سبحان الله العظيم",
        useful = "قال النبي صلى الله عليه وسلم: \"من قال سبحان الله العظيم وبحمده غرست له نخلة في الجنة\" (صحيح الترمذي)."
    ),
    Tasbeha(
        id = 3,
        name="لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير",
        useful = "قال النبي صلى الله عليه وسلم: \"من قال لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، عشر مرات في الصباح والمساء، كان كمن أعتق أربع نساء من ولد إسماعيل\" (صحيح البخاري)."
    ),
    Tasbeha(
        id = 4,
        name="لا حول ولا قوة إلا بالله",
        useful = " قال النبي صلى الله عليه وسلم: \"من قال لا حول ولا قوة إلا بالله عز وجل في وقت الشدة قالها ثلاث مرات، أُجيب دعوته\" (صحيح البخاري ومسلم)."
    ),
    Tasbeha(
        id = 5,
        name="الحمد لله",
        useful = "قال النبي صلى الله عليه وسلم: \"أحب الكلام إلى الله أربع: سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر\" (رواه مسلم)."
    ),
    Tasbeha(
        id = 6,
        name="أستغفر الله",
        useful = "قال النبي صلى الله عليه وسلم: \"من لا يستغفر الله يعذبه الله\" (رواه مسلم)."
    ),
    Tasbeha(
        id = 7,
        name="لا إله إلا الله",
        useful = "قال النبي صلى الله عليه وسلم: \"أحب الكلام إلى الله تعالى أربع، لا إله إلا الله والحمد لله وسبحان الله ولا حول ولا قوة إلا بالله\" (رواه مسلم)."
    ),
    Tasbeha(
        id = 8,
        name="أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه",
        useful = "من قالها من النهار موقنًا بها، فمات من يومه قبل أن يمسي فهو من أهل الجنة، ومن قالها من الليل وهو موقنٌ بها فمات قبل أن يصبح فهو من أهل الجنة\" (رواه البخاري)."
    ),
    Tasbeha(
        id = 9,
        name="سبحان الله وبحمده",
        useful = "قال النبي صلى الله عليه وسلم: \"من قال حين يصبح وحين يمسي سبحان الله وبحمده مائة مرة لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه\" (رواه مسلم).\n"
    ),
    Tasbeha(
        id = 10,
        name="اللهم صلِّ على محمد وعلى آل محمد",
        useful = "قال النبي صلى الله عليه وسلم: \"من صلَّى عليَّ صلاة واحدة صلى الله عليه عشر صلوات وحطت عنه عشر خطيئات ورفعت له عشر درجات\" (رواه مسلم).\n"
    ),
    Tasbeha(
        id = 11,
        name="إنا لله وإنا إليه راجعون",
        useful = "قال النبي صلى الله عليه وسلم: \"عجبًا لأمر المؤمن، إن أمره كله له خير، وليس ذلك لأحد إلا للمؤمن، إن أصابته سراء شكر فكان خيرًا له، وإن أصابته ضراء صبر فكان خيرًا له\" (رواه مسلم)."
    ),

)